package ex0806.서인석.ch02;

public class Exam {
    /*
     * 5장 문제 1, 2, 3 정답
     * 1. 2
     * - 참초타입(객체타입) 변수의 메모리는 힙에 생성
     * 2. 3
     * - GC에 의해 사용하지 않으면 자동 삭제
     * 3. 2
     * - .equals() 형태로 비교한다 -> 그냥 비교하면 주소값을 비교하고 값을 비교하지않음
     ******************************************************************
     * * 6장
     * 1. 3
     * - 하나의 클래스에 여러개의 객체 생성 가능
     * 2. 4
     * - 로컬 변수는 메서드 내부에서만 존재하고 블럭을 빠져나오면 사라진다
     * 3. 4
     * - 클래스는 필드와 메서드 없어도 가능
     * 4. 4
     * - 필드 선언은 생성자 선언 전 ,후 언제든 가능
     * 5. 1
     * - 객체 생성하려면 호출 반드시 필요
     * 6. 4
     * - 메소드 오버로딩으로 가능함
     * 7. 2
     * - 반드시 매개변수(param) 타입, 수, 순서가 달라야함
     * 8. 2
     * - 인스턴스 필드 -> static 블록에서 초기화 x
     * 9. 2
     * ????
     * 10. 4
     * - 클래스만 옮기면 동작 x
     * 11. 3
     * - 생략(default)은 같은 패키지에 소속된 클래스들을 허용
     * 12.
     * - private String name -> 필드
     * - public Member(String name) -> 생성자
     * - public void setName(String name) -> 메소드
     *
     * *
     * */
}
